import { CustomerServiceOutlined, MessageOutlined } from "@ant-design/icons";
import { Button } from "antd";
import { FC, useState } from "react";
import email from "../assets/img/email.png";
import openEmail from "../assets/img/OpenEmail.png";
import "../styles/support.css";
import { convertToShamsi } from "../utils";

const SupportPage: FC = () => {
  const [activeTab, setActiveTab] = useState<"open" | "closed">("open");

  const TicketsData = [
    {
      id: 0,
      title: "تیکت اول",
      status: 0,
      createdAt: "2024-08-10T06:15:21.000000Z",
      parentID: 1,
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 1,
      title: "تیکت دوم",
      status: 0,
      createdAt: "2024-08-10T06:15:21.000000Z",
      parentID: 0,
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 2,
      title: "تیکت سوم",
      status: 0,
      createdAt: "2024-08-10T06:15:21.000000Z",
      parentID: 0,
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 3,
      title: "تیکت چهارم",
      status: 1,
      createdAt: "2024-08-10T06:15:21.000000Z",
      parentID: 0,
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
    {
      id: 4,
      title: "تیکت پنجم",
      status: 1,
      createdAt: "2024-08-10T06:15:21.000000Z",
      parentID: 0,
      description:
        "لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ، و با استفاده از طراحان گرافیک است، چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است، و برای شرایط فعلی تکنولوژی مورد نیاز، و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد، کتابهای زیادی در شصت و سه درصد گذشته حال و آینده، شناخت فراوان جامعه و متخصصان را می طلبد، تا با نرم افزارها شناخت بیشتری را برای طراحان رایانه ای علی الخصوص طراحان خلاقی، و فرهنگ پیشرو در زبان فارسی ایجاد کرد، در این صورت می توان امید داشت که تمام و دشواری موجود در ارائه راهکارها، و شرایط سخت تایپ به پایان رسد و زمان مورد نیاز شامل حروفچینی دستاوردهای اصلی، و جوابگوی سوالات پیوسته اهل دنیای موجود طراحی اساسا مورد استفاده قرار گیرد.",
    },
  ];

  const filteredTickets = TicketsData.filter(
    (ticket) =>
      (activeTab === "open" && ticket.status === 0 && ticket.parentID == 0) ||
      (activeTab === "closed" && ticket.status === 1 && ticket.parentID == 0)
  );

  const handleAddTicket = () => {};
  

  return (
    <section>
      {/* ************ Header ********************* */}
      <div className="support-header">
        <div style={{ display: "flex", gap: "16px" }}>
          <CustomerServiceOutlined />
          پشتیبانی
        </div>

        {/* ******** Add Ticket ***************** */}

        <Button type="primary" onClick={handleAddTicket}>
          <MessageOutlined />
          ایجاد تیکت جدید{" "}
        </Button>
      </div>

      {/* ********** Ticket TabBar ************************ */}

      <div className="ticket-buttons">
        {/* Open Tickets Button */}
        <div
          style={{ textAlign: "center", cursor: "pointer" }}
          onClick={() => setActiveTab("open")}
        >
          <img
            src={activeTab === "open" ? openEmail : email}
            alt="Open Tickets"
            style={{ width: "50px", height: "50px" }}
          />
          <div
            className={
              activeTab === "open"
                ? "ticket-active-button"
                : "ticket-nonactive-button"
            }
          >
            تیکت های باز
          </div>
        </div>

        {/* Closed Tickets Button */}
        <div
          style={{ textAlign: "center", cursor: "pointer" }}
          onClick={() => setActiveTab("closed")}
        >
          <img
            src={activeTab === "closed" ? openEmail : email}
            alt="Closed Tickets"
            style={{ width: "50px", height: "50px" }}
          />
          <div
            className={
              activeTab === "closed"
                ? "ticket-active-button"
                : "ticket-nonactive-button"
            }
          >
            تیکت های بسته
          </div>
        </div>
      </div>

      {/* ******** Tickets ********************************************** */}

      <div style={{ width: "100%" }}>
        {filteredTickets.map(({ id, title, createdAt }) => (
          <span className="ticket-message-card" key={id}>
            <p style={{ fontSize: "16px", fontWeight: "bold" }}>{title}</p>

            <p>{convertToShamsi(createdAt)}</p>

            <Button type="link" onClick={handleAddTicket}>
              <MessageOutlined />
              مشاهده تیکت{" "}
            </Button>
          </span>
        ))}
      </div>
    </section>
  );
};

export default SupportPage;

